my_string = input("Здравствуйте, напишите Ваше имя: ")
print("Очень приятно -", my_string)
print(len(my_string))
print("Здравствуйте, напишите Ваше имя:".upper())                         # строка в верхнем регистре
print("Здравствуйте, напишите Ваше имя:".lower())                         # строка в нижнем регистре
print("Здравствуйте, напишите Ваше имя:".replace(' ', ''))    # удалены все пробелы
print("Здравствуйте, напишите Ваше имя:"[:1])                             # первый символ строки
print("Здравствуйте, напишите Ваше имя:"[-1:])                            # последний символ строки

